import requests
def get_cookie(url,headers=None):
	'\n  Trích xuất giá trị cookie từ phản hồi của lần gửi yêu cầu đầu tiên. Giá trị Cookie này được sử dụng cho các yêu cầu tiếp theo.\n\n  Tham số\n    url (str): URL cần gửi yêu cầu.\n    headers (dict): Thông tin nhận dạng trong phần header căn bản.\n  ';A=headers
	if A is None:A={bytes([65,99,99,101,112,116]).decode():bytes([97,112,112,108,105,99,97,116,105,111,110,47,106,115,111,110,44,32,116,101,120,116,47,112,108,97,105,110,44,32,42,47,42]).decode(),bytes([65,99,99,101,112,116,45,76,97,110,103,117,97,103,101]).decode():bytes([101,110,45,85,83,44,101,110,59,113,61,48,46,57,44,118,105,45,86,78,59,113,61,48,46,56,44,118,105,59,113,61,48,46,55]).decode(),bytes([67,111,110,110,101,99,116,105,111,110]).decode():bytes([107,101,101,112,45,97,108,105,118,101]).decode(),bytes([85,115,101,114,45,65,103,101,110,116]).decode():bytes([77,111,122,105,108,108,97,47,53,46,48,32,40,87,105,110,100,111,119,115,32,78,84,32,49,48,46,48,59,32,87,105,110,54,52,59,32,120,54,52,59,32,114,118,58,49,50,49,46,48,41,32,71,101,99,107,111,47,50,48,49,48,48,49,48,49,32,70,105,114,101,102,111,120,47,49,50,49,46,48]).decode()}
	B=requests.get(url,headers=A,verify=True)
	if B.status_code==200:
		C=B.headers.get(bytes([83,101,116,45,67,111,111,107,105,101]).decode())
		if C:D=C;return D
		else:print(bytes([78,111,32,39,83,101,116,45,67,111,111,107,105,101,39,32,104,101,97,100,101,114,32,102,111,117,110,100,46]).decode())
	else:print(f"Error: {B.status_code}")